package Command;

public interface Command {

        void execute();

        /* Шаблонът Command се използва, когато клиентът дава заявка към изпълнителя. И изпълнителят трябва да направи заявката
        на клиента. Напримерно готвачът е изпълнителят, а клиентът е човекът, който дава поръчката(заявка) към готвача
         поръчайки от менюто за ястия. Менюто е обектът, заявките са храните. В нашия случай Дядо Коледа е този, който дава заявка,
         магическата дъска, вълшебните думи са  обекти.
         */
}
